ones = {1: "один", 2: "два", 3 : 'три', 4 : 'четыре', 5 : 'пять',
    6 : 'шесть', 7 : 'семь', 8 : 'восемь', 9 : 'девять'}
tens = {10: "десять", 20 : 'двадцать', 30 : 'тридцать', 40 : 'сорок',
    50 : 'пятьдесят', 60 : 'шестьдесят', 70 : 'семьдесят',
    80 : 'восемьдесят', 90 : 'девяносто'}
special = {11 : 'одиннадцать', 12 : 'двенадцать', 13 : 'тринадцать',
    14 : 'четырнадцать', 15 : 'пятнадцать', 16 : 'шестнадцать',
    17 : 'семнадцать', 18 : 'восемнадцать', 19 : 'девятнадцать'}
hundreds = {100: "сто", 200: "двести",300: "триста",
            400: "четыреста", 500: "пятьсот", 600: "шестьсот",
            700: "семьсот", 800: "восемьсот", 900: "девятьсот", 1000: "тысяча"}
number = int(input())
n1 = number % 10
n2 = number % 100 - n1
n3 = number - n2 - n1
result = ""
if (number > 100):
    result += hundreds.get(n3) + ' '
    number-=n3
if (10 < number < 20):
    result += special.get(number) + ' '
    number = 0
if (10<=number<100):
    result += tens.get(n2) + ' '
    number-= n2
if (1<= number < 10):
    result += ones.get(number) + ' '
print(result)